# Parameter Type Id Rebar Shape Crank End Straight Length Property

Source: https://www.revitapidocs.com/2026/d2be9ea2-4ea2-4d3a-40da-dee23d9976ef.htm

---

| Parameter Type Id Rebar Shape Crank End Straight Length Property |
| --- |

"End Crank Straight Length"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeCrankEndStraightLength { get; }
```

```
Public Shared ReadOnly Property RebarShapeCrankEndStraightLength As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeCrankEndStraightLength {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeCrankEndStraightLength : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace